# CLI tools
brew "atuin"
brew "fzf"
brew "gh"
brew "git"
brew "lsd"
brew "neovim"
brew "pyenv"
brew "thefuck"
brew "tmux"
brew "zoxide"

# Zsh plugins
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts
cask "font-meslo-lg-nerd-font"

# Applications (GUI)
cask "alacritty"
cask "claude-code"
cask "docker-desktop"
cask "ghostty"
cask "visual-studio-code"

