# CLI tools
brew "asdf"
brew "atuin"
brew "bat"
brew "bitwarden-cli"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "grpcurl"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "lsd"
brew "neovim"
brew "pixi"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "websocat"
brew "yq"
brew "zoxide"

# Node tools (run: npm install -g fkill-cli)
brew "node"

# Zsh plugins
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts
cask "font-meslo-lg-nerd-font"

# Applications (GUI)
cask "alacritty"
cask "claude-code"
cask "dashlane"
cask "docker-desktop"
cask "dropbox"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "obsidian"
cask "zotero"
cask "visual-studio-code"

